export const booksData = {
  data: [
    {
      id: 1,
      bookTitle: "苏东坡新传",
      bookAuthor: "李一冰",
      bookTag: "历史",
      bookDescription: "以诗词为主线，参考百余种书目，还原真实、立体的东坡形象",
    },
    {
      id: 2,
      bookTitle: "明朝那些事儿",
      bookAuthor: "当年明月",
      bookTag: "历史/小说",
      bookDescription:
        "《明朝那些事儿》讲述从1344年到1644年，明朝三百年间的历史。作品以史料为基础，以年代和具体人物为主线，运用小说的笔法，对明朝十七帝和其他王公权贵和小人物的命运进行全景展示，尤其对官场政治、战争、帝王心术着墨最多。作品也是一部明朝政治经济制度、人伦道德的演义。",
    },
    {
      id: 3,
      bookTitle: "百年孤独",
      bookAuthor: "加西亚·马尔克斯",
      bookTag: "外国文学",
      bookDescription:
        "《百年孤独》是魔幻现实主义文学的代表作，描写了布恩迪亚家族七代人的传奇故事，以及加勒比海沿岸小镇马孔多的百年兴衰，反映了拉丁美洲一个世纪以来风云变幻的历史。",
    },
    {
      id: 4,
      bookTitle: "活着",
      bookAuthor: "余华",
      bookTag: "小说/文学",
      bookDescription:
        "《活着(新版)》讲述了农村人福贵悲惨的人生遭遇。福贵本是个阔少爷，可他嗜赌如命，终于赌光了家业，一贫如洗。他的父亲被他活活气死，母亲则在穷困中患了重病，福贵前去求药，却在途中被国民党抓去当壮丁。经过几番波折回到家里，才知道母亲早已去世，妻子家珍含辛茹苦地养大两个儿女。此后更加悲惨的命运一次又一次降临到福贵身上，他的妻子、儿女和孙子相继死去，最后只剩福贵和一头老牛相依为命，但老人依旧活着，仿佛比往日更加洒脱与坚强。",
    },
    {
      id: 5,
      bookTitle: "呐喊",
      bookAuthor: "鲁迅",
      bookTag: "国内文学",
      bookDescription:
        "《呐喊》是鲁迅1918-1922年所作的短篇小说的结集，收有《狂人日记》、《孔乙己》、《药》、《明天》、《一件小事》、《头发的故事》等14篇作品。当时正值五四革命精神高扬时期。作者创作小说意在描写“病态社会的不幸的人们”，“揭出病苦，引起疗救的注意”，并为新文化运动“呐喊”。作品真实地描绘了从辛亥革命到五四时期的社会生活，揭示了种种深层次的社会矛盾，对封建制度及陈腐的传统观念进行了深刻的剖析和彻底的否定，表现出对民族生存的浓重的忧患意识和对社会变革的强烈渴望。",
    },
    {
      id: 6,
      bookTitle: "三体全集",
      bookAuthor: "刘慈欣",
      bookTag: "科幻",
      bookDescription:
        "三体三部曲 (《三体》《三体Ⅱ·黑暗森林》《三体Ⅲ·死神永生》) ，原名“地球往事三部曲”，是中国著名科幻作家刘慈欣的首个长篇系列，由科幻世界杂志社策划制作，重庆出版集团出版。小说讲述了文革期间一次偶然的星际通讯引发的三体世界对地球的入侵以及之后人类文明与三体文明三百多年的恩怨情仇。三体三部曲出版后十分畅销，并深受读者和主流媒体好评，被普遍认为是中国科幻文学的里程碑之作，为中国科幻确立了一个新高度。",
    },
  ],
  code: 0,
}
